tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf45k50_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF45K50_H_
#define _PIC18LF45K50_H_

#define SRCON1                        0
#define SRRC1E                        1
#define SRRC2E                        2
#define SRRCKE                        3
#define SRRPE                         4
#define SRSC1E                        5
#define SRSC2E                        6
#define SRSCKE                        7
#define SRSPE                         8
#define SRCON0                        9
#define SRPR                          10
#define SRPS                          11
#define SRNQEN                        12
#define SRQEN                         13
#define SRCLK0                        14
#define SRCLK                         15
#define SRCLK1                        16
#define SRCLK2                        17
#define SRLEN                         18
#define CCPTMRS                       19
#define C1TSEL                        20
#define C2TSEL                        21
#define ANSELA                        22
#define ANSA0                         23
#define ANSA1                         24
#define ANSA2                         25
#define ANSA3                         26
#define ANSA5                         27
#define ANSELB                        28
#define ANSB0                         29
#define ANSB1                         30
#define ANSB2                         31
#define ANSB3                         32
#define ANSB4                         33
#define ANSB5                         34
#define ANSELC                        35
#define ANSC2                         36
#define ANSC6                         37
#define ANSC7                         38
#define ANSELD                        39
#define ANSD0                         40
#define ANSD1                         41
#define ANSD2                         42
#define ANSD3                         43
#define ANSD4                         44
#define ANSD5                         45
#define ANSD6                         46
#define ANSD7                         47
#define ANSELE                        48
#define ANSE0                         49
#define ANSE1                         50
#define ANSE2                         51
#define UCON                          52
#define SUSPND                        53
#define RESUME                        54
#define USBEN                         55
#define PKTDIS                        56
#define SE0                           57
#define PPBRST                        58
#define USTAT                         59
#define PPBI                          60
#define DIR                           61
#define ENDP                          62
#define ENDP0                         63
#define ENDP1                         64
#define ENDP2                         65
#define ENDP3                         66
#define UCFG                          67
#define PPB                           68
#define UPP0                          69
#define PPB0                          70
#define UPP1                          71
#define PPB1                          72
#define FSEN                          73
#define UTRDIS                        74
#define UPUEN                         75
#define UOEMON                        76
#define UTEYE                         77
#define UADDR                         78
#define ADDR                          79
#define ADDR0                         80
#define ADDR1                         81
#define ADDR2                         82
#define ADDR3                         83
#define ADDR4                         84
#define ADDR5                         85
#define ADDR6                         86
#define UIE                           87
#define URSTIE                        88
#define UERRIE                        89
#define ACTVIE                        90
#define TRNIE                         91
#define IDLEIE                        92
#define STALLIE                       93
#define SOFIE                         94
#define UIR                           95
#define URSTIF                        96
#define UERRIF                        97
#define ACTVIF                        98
#define TRNIF                         99
#define IDLEIF                        100
#define STALLIF                       101
#define SOFIF                         102
#define UEIE                          103
#define PIDEE                         104
#define CRC5EE                        105
#define CRC16EE                       106
#define DFN8EE                        107
#define BTOEE                         108
#define BTSEE                         109
#define UEIR                          110
#define PIDEF                         111
#define CRC5EF                        112
#define CRC16EF                       113
#define DFN8EF                        114
#define BTOEF                         115
#define BTSEF                         116
#define UFRML                         117
#define FRML                          118
#define FRM0                          119
#define UFRML_FRM                     120
#define FRM1                          121
#define FRM2                          122
#define FRM3                          123
#define FRM4                          124
#define FRM5                          125
#define FRM6                          126
#define FRM7                          127
#define UFRMH                         128
#define FRM8                          129
#define UFRMH_FRM                     130
#define FRM9                          131
#define FRM10                         132
#define UEP0                          133
#define UEP0_EPSTALL                  134
#define EP0STALL                      135
#define EPSTALL0                      136
#define UEP0_EPINEN                   137
#define EPINEN0                       138
#define EP0INEN                       139
#define UEP0_EPOUTEN                  140
#define EP0OUTEN                      141
#define EPOUTEN0                      142
#define EPCONDIS0                     143
#define EP0CONDIS                     144
#define UEP0_EPCONDIS                 145
#define UEP0_EPHSHK                   146
#define EP0HSHK                       147
#define EPHSHK0                       148
#define UEP1                          149
#define EPSTALL1                      150
#define EP1STALL                      151
#define UEP1_EPSTALL                  152
#define EPINEN1                       153
#define EP1INEN                       154
#define UEP1_EPINEN                   155
#define EPOUTEN1                      156
#define UEP1_EPOUTEN                  157
#define EP1OUTEN                      158
#define UEP1_EPCONDIS                 159
#define EP1CONDIS                     160
#define EPCONDIS1                     161
#define EPHSHK1                       162
#define EP1HSHK                       163
#define UEP1_EPHSHK                   164
#define UEP2                          165
#define EP2STALL                      166
#define EPSTALL2                      167
#define UEP2_EPSTALL                  168
#define EP2INEN                       169
#define EPINEN2                       170
#define UEP2_EPINEN                   171
#define EP2OUTEN                      172
#define UEP2_EPOUTEN                  173
#define EPOUTEN2                      174
#define EP2CONDIS                     175
#define UEP2_EPCONDIS                 176
#define EPCONDIS2                     177
#define EP2HSHK                       178
#define EPHSHK2                       179
#define UEP2_EPHSHK                   180
#define UEP3                          181
#define UEP3_EPSTALL                  182
#define EPSTALL3                      183
#define EP3STALL                      184
#define UEP3_EPINEN                   185
#define EPINEN3                       186
#define EP3INEN                       187
#define EP3OUTEN                      188
#define EPOUTEN3                      189
#define UEP3_EPOUTEN                  190
#define UEP3_EPCONDIS                 191
#define EP3CONDIS                     192
#define EPCONDIS3                     193
#define EPHSHK3                       194
#define UEP3_EPHSHK                   195
#define EP3HSHK                       196
#define UEP4                          197
#define EP4STALL                      198
#define EPSTALL4                      199
#define UEP4_EPSTALL                  200
#define UEP4_EPINEN                   201
#define EP4INEN                       202
#define EPINEN4                       203
#define UEP4_EPOUTEN                  204
#define EPOUTEN4                      205
#define EP4OUTEN                      206
#define EPCONDIS4                     207
#define EP4CONDIS                     208
#define UEP4_EPCONDIS                 209
#define EPHSHK4                       210
#define EP4HSHK                       211
#define UEP4_EPHSHK                   212
#define UEP5                          213
#define EP5STALL                      214
#define UEP5_EPSTALL                  215
#define EPSTALL5                      216
#define EPINEN5                       217
#define UEP5_EPINEN                   218
#define EP5INEN                       219
#define EPOUTEN5                      220
#define UEP5_EPOUTEN                  221
#define EP5OUTEN                      222
#define EPCONDIS5                     223
#define EP5CONDIS                     224
#define UEP5_EPCONDIS                 225
#define UEP5_EPHSHK                   226
#define EPHSHK5                       227
#define EP5HSHK                       228
#define UEP6                          229
#define EPSTALL6                      230
#define UEP6_EPSTALL                  231
#define EP6STALL                      232
#define EP6INEN                       233
#define UEP6_EPINEN                   234
#define EPINEN6                       235
#define EP6OUTEN                      236
#define EPOUTEN6                      237
#define UEP6_EPOUTEN                  238
#define UEP6_EPCONDIS                 239
#define EP6CONDIS                     240
#define EPCONDIS6                     241
#define EPHSHK6                       242
#define UEP6_EPHSHK                   243
#define EP6HSHK                       244
#define UEP7                          245
#define UEP7_EPSTALL                  246
#define EP7STALL                      247
#define EPSTALL7                      248
#define EP7INEN                       249
#define EPINEN7                       250
#define UEP7_EPINEN                   251
#define EP7OUTEN                      252
#define UEP7_EPOUTEN                  253
#define EPOUTEN7                      254
#define UEP7_EPCONDIS                 255
#define EP7CONDIS                     256
#define EPCONDIS7                     257
#define EPHSHK7                       258
#define UEP7_EPHSHK                   259
#define EP7HSHK                       260
#define UEP8                          261
#define EPSTALL8                      262
#define UEP8_EPSTALL                  263
#define UEP8_EPINEN                   264
#define EPINEN8                       265
#define UEP8_EPOUTEN                  266
#define EPOUTEN8                      267
#define UEP8_EPCONDIS                 268
#define EPCONDIS8                     269
#define UEP8_EPHSHK                   270
#define EPHSHK8                       271
#define UEP9                          272
#define EPSTALL9                      273
#define UEP9_EPSTALL                  274
#define EPINEN9                       275
#define UEP9_EPINEN                   276
#define UEP9_EPOUTEN                  277
#define EPOUTEN9                      278
#define UEP9_EPCONDIS                 279
#define EPCONDIS9                     280
#define UEP9_EPHSHK                   281
#define EPHSHK9                       282
#define UEP10                         283
#define EPSTALL10                     284
#define UEP10_EPSTALL                 285
#define EPINEN10                      286
#define UEP10_EPINEN                  287
#define UEP10_EPOUTEN                 288
#define EPOUTEN10                     289
#define EPCONDIS10                    290
#define UEP10_EPCONDIS                291
#define UEP10_EPHSHK                  292
#define EPHSHK10                      293
#define UEP11                         294
#define UEP11_EPSTALL                 295
#define EPSTALL11                     296
#define EPINEN11                      297
#define UEP11_EPINEN                  298
#define UEP11_EPOUTEN                 299
#define EPOUTEN11                     300
#define EPCONDIS11                    301
#define UEP11_EPCONDIS                302
#define UEP11_EPHSHK                  303
#define EPHSHK11                      304
#define UEP12                         305
#define EPSTALL12                     306
#define UEP12_EPSTALL                 307
#define UEP12_EPINEN                  308
#define EPINEN12                      309
#define EPOUTEN12                     310
#define UEP12_EPOUTEN                 311
#define EPCONDIS12                    312
#define UEP12_EPCONDIS                313
#define EPHSHK12                      314
#define UEP12_EPHSHK                  315
#define UEP13                         316
#define UEP13_EPSTALL                 317
#define EPSTALL13                     318
#define EPINEN13                      319
#define UEP13_EPINEN                  320
#define UEP13_EPOUTEN                 321
#define EPOUTEN13                     322
#define EPCONDIS13                    323
#define UEP13_EPCONDIS                324
#define EPHSHK13                      325
#define UEP13_EPHSHK                  326
#define UEP14                         327
#define UEP14_EPSTALL                 328
#define EPSTALL14                     329
#define EPINEN14                      330
#define UEP14_EPINEN                  331
#define UEP14_EPOUTEN                 332
#define EPOUTEN14                     333
#define EPCONDIS14                    334
#define UEP14_EPCONDIS                335
#define UEP14_EPHSHK                  336
#define EPHSHK14                      337
#define UEP15                         338
#define UEP15_EPSTALL                 339
#define EPSTALL15                     340
#define UEP15_EPINEN                  341
#define EPINEN15                      342
#define UEP15_EPOUTEN                 343
#define EPOUTEN15                     344
#define EPCONDIS15                    345
#define UEP15_EPCONDIS                346
#define UEP15_EPHSHK                  347
#define EPHSHK15                      348
#define SLRCON                        349
#define SLRA                          350
#define SLRB                          351
#define SLRC                          352
#define SLRD                          353
#define SLRE                          354
#define VREFCON2                      355
#define DACR0                         356
#define DACR                          357
#define DACR1                         358
#define DACR2                         359
#define DACR3                         360
#define DACR4                         361
#define VREFCON1                      362
#define DACNSS                        363
#define DACPSS                        364
#define DACPSS0                       365
#define DACPSS1                       366
#define DACOE                         367
#define DACLPS                        368
#define DACEN                         369
#define VREFCON0                      370
#define TSRNG                         371
#define TSEN                          372
#define FVRS                          373
#define FVRS0                         374
#define FVRS1                         375
#define FVRST                         376
#define FVREN                         377
#define PMD0                          378
#define TMR1MD                        379
#define SPI1MD                        380
#define TMR2MD                        381
#define SPI2MD                        382
#define TMR3MD                        383
#define ACTMD                         384
#define STMD                          385
#define USBMD                         386
#define UARTMD                        387
#define UART1MD                       388
#define PMD1                          389
#define EMBMD                         390
#define CCP1MD                        391
#define CCP2MD                        392
#define ADCMD                         393
#define CMP1MD                        394
#define CMP2MD                        395
#define CTMUMD                        396
#define MSSPMD                        397
#define SSP1MD                        398
#define MSSP1MD                       399
#define PORTA                         400
#define ULPWUIN                       401
#define AN0                           402
#define PORTA_RA0                     403
#define AN1                           404
#define PORTA_RA1                     405
#define AN2                           406
#define PORTA_RA2                     407
#define VREFM                         408
#define AN3                           409
#define PORTA_RA3                     410
#define VREFP                         411
#define PORTA_RA4                     412
#define T0CKI                         413
#define AN4                           414
#define PORTA_RA5                     415
#define LVDIN                         416
#define HLVDIN                        417
#define PORTA_RA6                     418
#define OSC2                          419
#define PORTA_RA7                     420
#define RJPU                          421
#define PORTB                         422
#define INT0                          423
#define PORTB_RB0                     424
#define INT1                          425
#define PORTB_RB1                     426
#define INT2                          427
#define PORTB_RB2                     428
#define CCP2_PA2                      429
#define PORTB_RB3                     430
#define PORTB_RB4                     431
#define PGM                           432
#define PORTB_RB5                     433
#define PGC                           434
#define PORTB_RB6                     435
#define PGD                           436
#define PORTB_RB7                     437
#define PORTC                         438
#define T13CKI                        439
#define T1OSO                         440
#define PORTC_RC0                     441
#define CCP2                          442
#define T1OSI                         443
#define PA2                           444
#define PORTC_RC1                     445
#define CCP1                          446
#define P1A                           447
#define PA1                           448
#define PORTC_RC2                     449
#define RC4                           450
#define RC5                           451
#define TX                            452
#define CK                            453
#define PORTC_RC6                     454
#define DT                            455
#define RX                            456
#define PORTC_RC7                     457
#define PORTD                         458
#define SPP0                          459
#define PORTD_RD0                     460
#define PORTD_RD1                     461
#define SPP1                          462
#define PORTD_RD2                     463
#define SPP2                          464
#define PORTD_RD3                     465
#define SPP3                          466
#define SPP4                          467
#define PORTD_RD4                     468
#define SPP5                          469
#define PORTD_RD5                     470
#define PORTD_RD6                     471
#define SPP6                          472
#define PORTD_RD7                     473
#define SS2                           474
#define SPP7                          475
#define PORTE                         476
#define CK1SPP                        477
#define PD2                           478
#define RDE                           479
#define PORTE_RE0                     480
#define CK2SPP                        481
#define WRE                           482
#define PC2                           483
#define PORTE_RE1                     484
#define CCP10                         485
#define OESPP                         486
#define PB2                           487
#define CS                            488
#define PORTE_RE2                     489
#define RE3                           490
#define CCP9E                         491
#define PC3E                          492
#define WPUB                          493
#define WPUB0                         494
#define WPUB1                         495
#define WPUB2                         496
#define WPUB3                         497
#define WPUB4                         498
#define WPUB5                         499
#define WPUB6                         500
#define WPUB7                         501
#define IOCB                          502
#define IOCB4                         503
#define IOCB5                         504
#define IOCB6                         505
#define IOCB7                         506
#define IOCC                          507
#define IOCC0                         508
#define IOCC1                         509
#define IOCC2                         510
#define IOCC4                         511
#define IOCC5                         512
#define IOCC6                         513
#define IOCC7                         514
#define CTMUICON                      515
#define IRNG                          516
#define IRNG0                         517
#define IRNG1                         518
#define ITRIM0                        519
#define ITRIM                         520
#define ITRIM1                        521
