tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf45k50_tdd.h
#define ITRIM2                        522
#define ITRIM3                        523
#define ITRIM4                        524
#define ITRIM5                        525
#define LATA                          526
#define LATA0                         527
#define LA0                           528
#define LATA1                         529
#define LA1                           530
#define LATA2                         531
#define LA2                           532
#define LATA3                         533
#define LA3                           534
#define LATA4                         535
#define LA4                           536
#define LATA5                         537
#define LA5                           538
#define LATA6                         539
#define LA6                           540
#define LATA7                         541
#define LA7                           542
#define LATB                          543
#define LB0                           544
#define LATB0                         545
#define LB1                           546
#define LATB1                         547
#define LB2                           548
#define LATB2                         549
#define LB3                           550
#define LATB3                         551
#define LB4                           552
#define LATB4                         553
#define LB5                           554
#define LATB5                         555
#define LB6                           556
#define LATB6                         557
#define LB7                           558
#define LATB7                         559
#define LATC                          560
#define LATC0                         561
#define LC0                           562
#define LATC1                         563
#define LC1                           564
#define LATC2                         565
#define LC2                           566
#define LATC4                         567
#define LC4                           568
#define LATC5                         569
#define LC5                           570
#define LC6                           571
#define LATC6                         572
#define LATC7                         573
#define LC7                           574
#define LATD                          575
#define LATD0                         576
#define LD0                           577
#define LATD1                         578
#define LD1                           579
#define LATD2                         580
#define LD2                           581
#define LATD3                         582
#define LD3                           583
#define LATD4                         584
#define LD4                           585
#define LATD5                         586
#define LD5                           587
#define LATD6                         588
#define LD6                           589
#define LATD7                         590
#define LD7                           591
#define LATE                          592
#define LATE0                         593
#define LE0                           594
#define LATE1                         595
#define LE1                           596
#define LATE2                         597
#define LE2                           598
#define CTMUCONL                      599
#define EDG1STAT                      600
#define EDG2STAT                      601
#define EDG1SEL                       602
#define EDG1SEL0                      603
#define EDG1SEL1                      604
#define EDG1POL                       605
#define EDG2SEL0                      606
#define EDG2SEL                       607
#define EDG2SEL1                      608
#define EDG2POL                       609
#define CTMUCONH                      610
#define TRIGEN                        611
#define CTTRIG                        612
#define IDISSEN                       613
#define EDGSEQEN                      614
#define EDGEN                         615
#define TGEN                          616
#define SIDL                          617
#define CTMUSIDL                      618
#define ON                            619
#define CTMUEN                        620
#define CCPR2L                        621
#define CCPR2H                        622
#define TRISA                         623
#define TRISA0                        624
#define TRISA_RA0                     625
#define TRISA1                        626
#define TRISA_RA1                     627
#define TRISA2                        628
#define TRISA_RA2                     629
#define TRISA3                        630
#define TRISA_RA3                     631
#define TRISA_RA4                     632
#define TRISA4                        633
#define TRISA_RA5                     634
#define TRISA5                        635
#define TRISA_RA6                     636
#define TRISA6                        637
#define TRISA_RA7                     638
#define TRISA7                        639
#define TRISB                         640
#define TRISB_RB0                     641
#define TRISB0                        642
#define TRISB_RB1                     643
#define TRISB1                        644
#define TRISB_RB2                     645
#define TRISB2                        646
#define TRISB_RB3                     647
#define TRISB3                        648
#define TRISB_RB4                     649
#define TRISB4                        650
#define TRISB_RB5                     651
#define TRISB5                        652
#define TRISB_RB6                     653
#define TRISB6                        654
#define TRISB_RB7                     655
#define TRISB7                        656
#define TRISC                         657
#define TRISC0                        658
#define TRISC_RC0                     659
#define TRISC1                        660
#define TRISC_RC1                     661
#define TRISC2                        662
#define TRISC_RC2                     663
#define TRISC4                        664
#define TRISC5                        665
#define TRISC6                        666
#define TRISC_RC6                     667
#define TRISC7                        668
#define TRISC_RC7                     669
#define TRISD                         670
#define TRISD_RD0                     671
#define TRISD0                        672
#define TRISD_RD1                     673
#define TRISD1                        674
#define TRISD_RD2                     675
#define TRISD2                        676
#define TRISD_RD3                     677
#define TRISD3                        678
#define TRISD_RD4                     679
#define TRISD4                        680
#define TRISD_RD5                     681
#define TRISD5                        682
#define TRISD_RD6                     683
#define TRISD6                        684
#define TRISD_RD7                     685
#define TRISD7                        686
#define TRISE                         687
#define TRISE_RE0                     688
#define TRISE0                        689
#define TRISE_RE1                     690
#define TRISE1                        691
#define TRISE_RE2                     692
#define TRISE2                        693
#define WPUE3                         694
#define CCP2CON                       695
#define CCP2M                         696
#define CCP2M0                        697
#define CCP2M1                        698
#define CCP2M2                        699
#define CCP2M3                        700
#define DC2B0                         701
#define CCP2Y                         702
#define DC2B                          703
#define DC2B1                         704
#define CCP2X                         705
#define CM1CON0                       706
#define C1CH                          707
#define C1CH0                         708
#define CM1CON0_CCH0                  709
#define CM1CON0_CCH                   710
#define CM1CON0_CCH1                  711
#define C1CH1                         712
#define CM1CON0_CREF                  713
#define C1R                           714
#define C1SP                          715
#define CM1CON0_CPOL                  716
#define C1POL                         717
#define CM1CON0_COE                   718
#define C1OE                          719
#define C1OUT                         720
#define COUT1                         721
#define CM1CON0_CON                   722
#define C1ON                          723
#define CM2CON0                       724
#define CM2CON0_CCH0                  725
#define C2CH0                         726
#define C2CH                          727
#define CM2CON0_CCH                   728
#define CM2CON0_CCH1                  729
#define C2CH1                         730
#define C2R                           731
#define CM2CON0_CREF                  732
#define C2SP                          733
#define C2POL                         734
#define CM2CON0_CPOL                  735
#define CM2CON0_COE                   736
#define C2OE                          737
#define C2OUT                         738
#define COUT2                         739
#define CM2CON0_CON                   740
#define C2ON                          741
#define CM2CON1                       742
#define C2SYNC                        743
#define C1SYNC                        744
#define C2HYS                         745
#define C1HYS                         746
#define C2RSEL                        747
#define C1RSEL                        748
#define MC2OUT                        749
#define MC1OUT                        750
#define OSCTUNE                       751
#define TUN0                          752
#define TUN                           753
#define TUN1                          754
#define TUN2                          755
#define TUN3                          756
#define TUN4                          757
#define TUN5                          758
#define TUN6                          759
#define SPLLMULT                      760
#define HLVDCON                       761
#define HLVDL                         762
#define HLVDL0                        763
#define HLVDL1                        764
#define HLVDL2                        765
#define HLVDL3                        766
#define HLVDEN                        767
#define IRVST                         768
#define BGVST                         769
#define VDIRMAG                       770
#define PIE1                          771
#define TMR1IE                        772
#define TMR2IE                        773
#define CCP1IE                        774
#define SSPIE                         775
#define SSP1IE                        776
#define TXIE                          777
#define TX1IE                         778
#define RCIE                          779
#define RC1IE                         780
#define ADIE                          781
#define STIE                          782
#define PSPIE                         783
#define ACTIE                         784
#define PIR1                          785
#define TMR1IF                        786
#define TMR2IF                        787
#define CCP1IF                        788
#define SSPIF                         789
#define SSP1IF                        790
#define TXIF                          791
#define TX1IF                         792
#define RCIF                          793
#define RC1IF                         794
#define ADIF                          795
#define PSPIF                         796
#define STIF                          797
#define ACTIF                         798
#define IPR1                          799
#define TMR1IP                        800
#define TMR2IP                        801
#define CCP1IP                        802
#define SSP1IP                        803
#define SSPIP                         804
#define TX1IP                         805
#define TXIP                          806
#define RC1IP                         807
#define RCIP                          808
#define ADIP                          809
#define ACTIP                         810
#define PSPIP                         811
#define STIP                          812
#define PIE2                          813
#define CCP2IE                        814
#define TMR3IE                        815
#define HLVDIE                        816
#define LVDIE                         817
#define BCLIE                         818
#define BCL1IE                        819
#define EEIE                          820
#define C2IE                          821
#define CM2IE                         822
#define C1IE                          823
#define CMIE                          824
#define CM1IE                         825
#define OSCFIE                        826
#define PIR2                          827
#define CCP2IF                        828
#define TMR3IF                        829
#define HLVDIF                        830
#define LVDIF                         831
#define BCLIF                         832
#define BCL1IF                        833
#define EEIF                          834
#define C2IF                          835
#define CM2IF                         836
#define C1IF                          837
#define CMIF                          838
#define CM1IF                         839
#define OSCFIF                        840
#define IPR2                          841
#define CCP2IP                        842
#define TMR3IP                        843
#define HLVDIP                        844
#define LVDIP                         845
#define BCL1IP                        846
#define BCLIP                         847
#define EEIP                          848
#define CM2IP                         849
#define C2IP                          850
#define CM1IP                         851
#define C1IP                          852
#define CMIP                          853
#define OSCFIP                        854
#define PIE3                          855
#define TMR1GIE                       856
#define RXB0IE                        857
#define RXBNIE                        858
#define TMR3GIE                       859
#define RXB1IE                        860
#define USBIE                         861
#define TXB0IE                        862
#define TXB1IE                        863
#define CTMUIE                        864
#define PIR3                          865
#define TMR1GIF                       866
#define RXBNIF                        867
#define TMR3GIF                       868
#define USBIF                         869
#define CTMUIF                        870
#define IPR3                          871
#define TMR1GIP                       872
#define TMR3GIP                       873
#define RXBNIP                        874
#define USBIP                         875
#define CTMUIP                        876
#define EECON1                        877
#define RD                            878
#define WR                            879
#define WREN                          880
#define WRERR                         881
#define FREE                          882
#define CFGS                          883
#define EEFS                          884
#define EEPGD                         885
#define EECON2                        886
#define RCSTA1                        887
#define RCD8                          888
#define RX9D                          889
#define OERR                          890
#define FERR                          891
#define ADDEN                         892
#define ADEN                          893
#define CREN                          894
#define SREN                          895
#define SRENA                         896
#define RC8_9                         897
#define RC9                           898
#define RX9                           899
#define SPEN                          900
#define TXSTA1                        901
#define TXD8                          902
#define TX9D1                         903
#define TX9D                          904
#define TRMT                          905
#define TRMT1                         906
#define BRGH1                         907
#define BRGH                          908
#define SENDB1                        909
#define SENDB                         910
#define SYNC                          911
#define SYNC1                         912
#define TXEN1                         913
#define TXEN                          914
#define TX91                          915
#define TX8_9                         916
#define TX9                           917
#define CSRC1                         918
#define CSRC                          919
#define TXREG1                        920
#define RCREG1                        921
#define BRG0                          922
#define SPBRG1                        923
#define BRG1                          924
#define BRG2                          925
#define BRG3                          926
#define BRG4                          927
#define BRG5                          928
#define BRG6                          929
#define BRG7                          930
#define BRG8                          931
#define SPBRGH1                       932
#define BRG9                          933
#define BRG10                         934
#define BRG11                         935
#define BRG12                         936
#define BRG13                         937
#define BRG14                         938
#define BRG15                         939
#define T3CON                         940
#define TMR3ON                        941
#define T3CON_RD16                    942
#define T3RD16                        943
#define nT3SYNC                       944
#define NOT_T3SYNC                    945
#define T3SYNC                        946
#define SOSCEN3                       947
#define T3SOSCEN                      948
#define T3OSCEN                       949
#define T3CON_SOSCEN                  950
#define T3CKPS0                       951
#define T3CKPS                        952
#define T3CKPS1                       953
#define TMR3CS0                       954
#define TMR3CS                        955
#define TMR3CS1                       956
#define RD163                         957
#define TMR3L                         958
#define TMR3H                         959
#define T3GCON                        960
#define T3GSS0                        961
#define T3GSS                         962
#define T3GSS1                        963
#define T3GVAL                        964
#define T3GGO_NOT_DONE                965
#define T3GGO                         966
#define T3GGO_nDONE                   967
#define T3DONE                        968
#define NOT_T3DONE                    969
#define nT3DONE                       970
#define T3GGO_nT3DONE                 971
#define T3GGO_NOT_T3DONE              972
#define T3GSPM                        973
#define T3GTM                         974
#define T3GPOL                        975
#define TMR3GE                        976
#define ACTCON                        977
#define STOR                          978
#define ACTORS                        979
#define ACTOR                         980
#define STLOCK                        981
#define ACTLOCK                       982
#define STSRC                         983
#define ACTSRC                        984
#define STUD                          985
#define ACTUD                         986
#define ACTD                          987
#define ACTEN                         988
#define STEN                          989
#define ACTSEL                        990
#define P1SSBD                        991
#define PSSBD0                        992
#define PSS1BD0                       993
#define PSS1BD                        994
#define PSSBD1                        995
#define PSS1BD1                       996
#define PSSAC0                        997
#define P1SSAC                        998
#define PSS1AC                        999
#define PSS1AC0                       1000
#define PSSAC1                        1001
#define PSS1AC1                       1002
#define ECCP1AS                       1003
#define CCP1AS                        1004
#define ECCP1AS0                      1005
#define ECCP1AS1                      1006
#define ECCP1AS2                      1007
#define CCP1ASE                       1008
#define ECCP1ASE                      1009
#define PWM1CON                       1010
#define PDC0                          1011
#define P1DC                          1012
#define PDC1                          1013
#define PDC2                          1014
#define PDC3                          1015
#define PDC4                          1016
#define PDC5                          1017
#define PDC6                          1018
#define P1RSEN                        1019
#define PR1SEN                        1020
#define BAUDCON1                      1021
#define ABDEN1                        1022
#define ABDEN                         1023
#define WUE1                          1024
#define W4E                           1025
#define WUE                           1026
#define BRG161                        1027
#define BRG16                         1028
#define CKTXP                         1029
#define SCKP1                         1030
#define TXCKP                         1031
#define TXCKP1                        1032
#define SCKP                          1033
#define DTRXP1                        1034
#define RXDTP1                        1035
#define DTRXP                         1036
#define RXCKP                         1037
#define RXDTP                         1038
#define RCMT1                         1039
#define RCIDL1                        1040
#define RCIDL                         1041
#define RCMT                          1042
#define ABDOVF                        1043
#define ABDOVF1                       1044
#define PSTR1CON                      1045
#define STR1A                         1046
#define STRA                          1047
#define STR1B                         1048
#define STRB                          1049
#define STR1C                         1050
#define STRC                          1051
#define STR1D                         1052
#define STRD                          1053
#define STR1SYNC                      1054
#define STRSYNC                       1055
#define T2CON                         1056
#define T2CKPS0                       1057
#define T2CKPS                        1058
#define T2CKPS1                       1059
#define TMR2ON                        1060
#define T2OUTPS0                      1061
#define T2OUTPS                       1062
#define T2OUTPS1                      1063
#define T2OUTPS2                      1064
#define T2OUTPS3                      1065
#define PR2                           1066
#define TMR2                          1067
#define CCP1CON                       1068
#define CCP1M0                        1069
#define CCP1M                         1070
#define CCP1M1                        1071
#define CCP1M2                        1072
#define CCP1M3                        1073
#define CCP1Y                         1074
#define DC1B                          1075
#define DC1B0                         1076
#define CCP1X                         1077
#define DC1B1                         1078
#define P1M                           1079
#define P1M0                          1080
#define P1M1                          1081
#define CCPR1L                        1082
#define CCPR1H                        1083
#define ADCON2                        1084
#define ADCS0                         1085
#define ADCS                          1086
#define ADCS1                         1087
#define ADCS2                         1088
#define ACQT0                         1089
#define ACQT                          1090
