tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf45k50_tdd.h
#define ACQT1                         1091
#define ACQT2                         1092
#define ADFM                          1093
#define ADCON1                        1094
#define NVCFG                         1095
#define NVCFG0                        1096
#define NVCFG1                        1097
#define PVCFG                         1098
#define PVCFG0                        1099
#define CHSN3                         1100
#define PVCFG1                        1101
#define TRIGSEL                       1102
#define ADCON0                        1103
#define ADON                          1104
#define nDONE                         1105
#define GODONE                        1106
#define GO_nDONE                      1107
#define NOT_DONE                      1108
#define GO_DONE                       1109
#define DONE                          1110
#define GO                            1111
#define GO_NOT_DONE                   1112
#define CHS                           1113
#define SSP1CON2                      1114
#define SEN1                          1115
#define SEN                           1116
#define ADMSK11                       1117
#define RSEN1                         1118
#define RSEN                          1119
#define ADMSK1                        1120
#define PEN                           1121
#define ADMSK21                       1122
#define PEN1                          1123
#define ADMSK2                        1124
#define ADMSK31                       1125
#define RCEN                          1126
#define RCEN1                         1127
#define ADMSK3                        1128
#define ACKEN                         1129
#define ACKEN1                        1130
#define ADMSK41                       1131
#define ADMSK4                        1132
#define ACKDT1                        1133
#define ADMSK51                       1134
#define ADMSK5                        1135
#define ACKDT                         1136
#define ACKSTAT                       1137
#define ACKSTAT1                      1138
#define GCEN                          1139
#define GCEN1                         1140
#define SSP1CON1                      1141
#define SSPM0                         1142
#define SSPM                          1143
#define SSPM01                        1144
#define SSPM1                         1145
#define SSPM11                        1146
#define SSPM2                         1147
#define SSPM21                        1148
#define SSPM31                        1149
#define SSPM3                         1150
#define CKP                           1151
#define CKP1                          1152
#define SSPEN                         1153
#define SSPEN1                        1154
#define SSPOV1                        1155
#define SSPOV                         1156
#define WCOL1                         1157
#define WCOL                          1158
#define SSP1STAT                      1159
#define BF                            1160
#define BF1                           1161
#define UA1                           1162
#define UA                            1163
#define R_NOT_W                       1164
#define READ_WRITE                    1165
#define RW1                           1166
#define NOT_W                         1167
#define R_W                           1168
#define RW                            1169
#define R                             1170
#define nWRITE                        1171
#define nW                            1172
#define R_nW                          1173
#define I2C_READ                      1174
#define START                         1175
#define START1                        1176
#define S                             1177
#define I2C_START                     1178
#define STOP                          1179
#define I2C_STOP                      1180
#define STOP1                         1181
#define P                             1182
#define NOT_A                         1183
#define DATA_ADDRESS                  1184
#define nA                            1185
#define D_A                           1186
#define D_nA                          1187
#define D                             1188
#define DA1                           1189
#define DA                            1190
#define D_NOT_A                       1191
#define nADDRESS                      1192
#define I2C_DAT                       1193
#define CKE                           1194
#define CKE1                          1195
#define SMP                           1196
#define SMP1                          1197
#define MSK0                          1198
#define SSP1ADD0                      1199
#define MSK01                         1200
#define SSP1ADD                       1201
#define MSK11                         1202
#define MSK1                          1203
#define SSP1ADD1                      1204
#define MSK2                          1205
#define MSK21                         1206
#define SSP1ADD2                      1207
#define MSK31                         1208
#define MSK3                          1209
#define SSP1ADD3                      1210
#define MSK4                          1211
#define MSK41                         1212
#define SSP1ADD4                      1213
#define MSK51                         1214
#define MSK5                          1215
#define SSP1ADD5                      1216
#define MSK6                          1217
#define SSP1ADD6                      1218
#define MSK61                         1219
#define MSK71                         1220
#define MSK7                          1221
#define SSP1ADD7                      1222
#define SSP1BUF                       1223
#define SSP1MSK0                      1224
#define SSP1MSK                       1225
#define SSP1MSK1                      1226
#define SSP1MSK2                      1227
#define SSP1MSK3                      1228
#define SSP1MSK4                      1229
#define SSP1MSK5                      1230
#define SSP1MSK6                      1231
#define SSP1MSK7                      1232
#define SSP1CON3                      1233
#define DHEN                          1234
#define AHEN                          1235
#define SBCDE                         1236
#define SDAHT                         1237
#define BOEN                          1238
#define SCIE                          1239
#define PCIE                          1240
#define ACKTIM                        1241
#define T1GCON                        1242
#define T1GSS0                        1243
#define T1GSS                         1244
#define T1GSS1                        1245
#define T1GVAL                        1246
#define T1GGO_nT1DONE                 1247
#define T1GGO_NOT_DONE                1248
#define T1GGO_nDONE                   1249
#define T1DONE                        1250
#define nT1DONE                       1251
#define T1GGO_NOT_T1DONE              1252
#define NOT_T1DONE                    1253
#define T1GGO                         1254
#define T1GSPM                        1255
#define T1GTM                         1256
#define T1GPOL                        1257
#define TMR1GE                        1258
#define T1CON                         1259
#define TMR1ON                        1260
#define T1CON_RD16                    1261
#define T1RD16                        1262
#define NOT_T1SYNC                    1263
#define T1SYNC                        1264
#define nT1SYNC                       1265
#define T1SOSCEN                      1266
#define T1CON_SOSCEN                  1267
#define T1OSCEN                       1268
#define T1CKPS0                       1269
#define T1CKPS                        1270
#define T1CKPS1                       1271
#define TMR1CS0                       1272
#define TMR1CS                        1273
#define TMR1CS1                       1274
#define TMR1L                         1275
#define TMR1H                         1276
#define RCON                          1277
#define BOR                           1278
#define NOT_BOR                       1279
#define nBOR                          1280
#define POR                           1281
#define nPOR                          1282
#define NOT_POR                       1283
#define PD                            1284
#define nPD                           1285
#define NOT_PD                        1286
#define NOT_TO                        1287
#define nTO                           1288
#define TO                            1289
#define nRI                           1290
#define NOT_RI                        1291
#define RI                            1292
#define SBOREN                        1293
#define IPEN                          1294
#define WDTCON                        1295
#define SWDTE                         1296
#define SWDTEN                        1297
#define OSCCON2                       1298
#define LFIOFS                        1299
#define HFIOFR                        1300
#define PRISD                         1301
#define SOSCGO                        1302
#define PLLEN                         1303
#define INTSRC                        1304
#define SOSCRUN                       1305
#define PLLRDY                        1306
#define OSCCON                        1307
#define SCS0                          1308
#define SCS                           1309
#define SCS1                          1310
#define FLTS                          1311
#define HFIOFS                        1312
#define OSTS                          1313
#define IRCF                          1314
#define IRCF0                         1315
#define IRCF1                         1316
#define IRCF2                         1317
#define IDLEN                         1318
#define T0CON                         1319
#define T0PS                          1320
#define T0PS0                         1321
#define T0PS1                         1322
#define T0PS2                         1323
#define PSA                           1324
#define T0SE                          1325
#define T0CS                          1326
#define T08BIT                        1327
#define TMR0ON                        1328
#define TMR0L                         1329
#define TMR0H                         1330
#define STATUS                        1331
#define C                             1332
#define CARRY                         1333
#define DC                            1334
#define ZERO                          1335
#define Z                             1336
#define OV                            1337
#define OVERFLOW                      1338
#define N                             1339
#define NEGATIVE                      1340
#define FSR2L                         1341
#define PLUSW2                        1342
#define PREINC2                       1343
#define POSTDEC2                      1344
#define POSTINC2                      1345
#define INDF2                         1346
#define FSR1L                         1347
#define PLUSW1                        1348
#define PREINC1                       1349
#define POSTDEC1                      1350
#define POSTINC1                      1351
#define INDF1                         1352
#define WREG                          1353
#define FSR0L                         1354
#define PLUSW0                        1355
#define PREINC0                       1356
#define POSTDEC0                      1357
#define POSTINC0                      1358
#define INDF0                         1359
#define INTCON3                       1360
#define INT1IF                        1361
#define INT1F                         1362
#define INT2IF                        1363
#define INT2F                         1364
#define INT1E                         1365
#define INT1IE                        1366
#define INT2IE                        1367
#define INT2E                         1368
#define INT1P                         1369
#define INT1IP                        1370
#define INT2IP                        1371
#define INT2P                         1372
#define INTCON2                       1373
#define IOCIP                         1374
#define TMR0IP                        1375
#define T0IP                          1376
#define INTEDG2                       1377
#define INTEDG1                       1378
#define INTEDG0                       1379
#define RBPU                          1380
#define NOT_RBPU                      1381
#define nRBPU                         1382
#define INTCON                        1383
#define IOCIF                         1384
#define INT0F                         1385
#define INT0IF                        1386
#define T0IF                          1387
#define TMR0IF                        1388
#define IOCIE                         1389
#define INT0E                         1390
#define INT0IE                        1391
#define T0IE                          1392
#define TMR0IE                        1393
#define PEIE                          1394
#define PEIE_GIEL                     1395
#define GIEL                          1396
#define GIEH                          1397
#define GIE_GIEH                      1398
#define GIE                           1399
#define PRODL                         1400
#define PRODH                         1401
#define TABLAT                        1402
#define TBLPTRL                       1403
#define TBLPTRH                       1404
#define PCL                           1405
#define PCLATH                        1406
#define PCH                           1407
#define SP0                           1408
#define STKPTR                        1409
#define SP1                           1410
#define SP2                           1411
#define SP3                           1412
#define SP4                           1413
#define STKUNF                        1414
#define STKOVF                        1415
#define STKFUL                        1416
#define TOSL                          1417
#define TOSH                          1418

#endif // _PIC18LF45K50_H_
